# 洗碗工小明碰上了一位强迫症老板老王，餐厅一共就10只盘子，老板给仔细编上了0～9等10个号码，并要求小明按照从0到9的编号来洗盘子，当然，每洗好一只盘子，就必须得整齐叠放起来。
# 小明洗盘子期间，经常就有顾客来取盘子，当然每位顾客只能从盘子堆最上面取1只盘子离开。
# 老王在收银台仔细地记录了顾客依次取到盘子的编号，比如“1043257689”，这样他就能判断小明是不是遵照命令按照0123456789的次序来洗盘子了。

from DSA22.pythonds.basic.stack import Stack

st = Stack()
# s = input()
# s='1043257689'
s='0123456789'
# s='9876543210'


n = 0  # 正在洗的盘子编号
i = 0  # 取盘子的次序，s[i]为取得盘子的编号
while i < 10 and n < 10:
    k = int(s[i])
    # 洗盘子
    # 如果顾客取到了编号为K的盘子，那么说明正在洗的盘子到k之间所有的盘子都洗好叠放好了
    if n <= k:
        for m in range(n, k + 1):
            st.push(m)
            print('push', m)
        n = k + 1  # 正在洗下一个盘子
    # 取盘子
    # 逐个从顶上取盘子，从K开始取，一直取到对不上号，说明要去取的还没洗
    while not st.isEmpty() and k == st.peek():
        m = st.pop()
        print('pop', m)
        i += 1

if st.isEmpty():
    print("Yes")
else:
    print("No")
